; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph7 - mode
	image9 - mode
	infrared3 - mode
	spectrograph4 - mode
	image0 - mode
	image2 - mode
	infrared5 - mode
	thermograph10 - mode
	image1 - mode
	infrared6 - mode
	thermograph8 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph8)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph7)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image2)
	(supports instrument2 thermograph7)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 thermograph10)
	(supports instrument3 infrared6)
	(supports instrument3 infrared5)
	(supports instrument3 image0)
	(supports instrument3 image9)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(have_image Planet6 thermograph7)
	(have_image Planet6 infrared6)
	(have_image Planet6 thermograph8)
	(have_image Planet7 infrared6)
	(have_image Planet7 image9)
	(have_image Planet7 infrared5)
	(have_image Planet8 thermograph10)
	(have_image Planet8 thermograph8)
	(have_image Star9 infrared6)
	(have_image Star9 thermograph10)
	(have_image Star9 spectrograph4)
	(have_image Phenomenon10 image1)
))

)

; plan
1. (turn_to satellite1 groundstation3 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 12
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite1 planet7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet7)
   goals met: 0 of 12
5. (take_image satellite1 planet7 instrument3 infrared6)
   added: (have_image planet7 infrared6)
   goals met: 1 of 12
6. (take_image satellite1 planet7 instrument3 infrared5)
   added: (have_image planet7 infrared5)
   goals met: 2 of 12
7. (take_image satellite1 planet7 instrument3 image9)
   added: (have_image planet7 image9)
   goals met: 3 of 12
8. (turn_to satellite1 planet6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet6)
   goals met: 3 of 12
9. (take_image satellite1 planet6 instrument3 infrared6)
   added: (have_image planet6 infrared6)
   goals met: 4 of 12
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 12
11. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 4 of 12
12. (turn_to satellite0 planet6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet6)
   goals met: 4 of 12
13. (take_image satellite0 planet6 instrument0 thermograph8)
   added: (have_image planet6 thermograph8)
   goals met: 5 of 12
14. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 5 of 12
15. (take_image satellite0 planet8 instrument0 thermograph8)
   added: (have_image planet8 thermograph8)
   goals met: 6 of 12
16. (turn_to satellite0 star9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star9)
   goals met: 6 of 12
17. (take_image satellite0 star9 instrument0 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 7 of 12
18. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 7 of 12
19. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 7 of 12
20. (turn_to satellite0 groundstation4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation4)
   goals met: 7 of 12
21. (calibrate satellite0 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 7 of 12
22. (turn_to satellite0 phenomenon10 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon10)
   goals met: 7 of 12
23. (take_image satellite0 phenomenon10 instrument2 image1)
   added: (have_image phenomenon10 image1)
   goals met: 8 of 12
24. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   goals met: 8 of 12
25. (take_image satellite0 planet6 instrument2 thermograph7)
   added: (have_image planet6 thermograph7)
   goals met: 9 of 12
26. (turn_to satellite1 planet8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet8)
   goals met: 9 of 12
27. (take_image satellite1 planet8 instrument3 thermograph10)
   added: (have_image planet8 thermograph10)
   goals met: 10 of 12
28. (turn_to satellite1 star9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star9)
   goals met: 10 of 12
29. (take_image satellite1 star9 instrument3 infrared6)
   added: (have_image star9 infrared6)
   goals met: 11 of 12
30. (take_image satellite1 star9 instrument3 thermograph10)
   added: (have_image star9 thermograph10)
   goals met: 12 of 12
